Repository: tukaani-project/xz
Catalog: po/*.po
Languages: ar

source: Invalid argument to --block-list
ar: معطى غير صالح لـ {LRM}--block-list

source: Too many arguments to --block-list
ar: معطيات كثيرة جداً لـ {LRM}--block-list

source: In --block-list, block size is missing after filter chain number '%c:'
ar: في {LRM}--block-list، حجم الكتلة مفقود بعد رقم تسلسل المرشح '%c:'

source: 0 can only be used as the last element in --block-list
ar: يمكن استخدام 0 فقط كعنصر أخير في {LRM}--block-list

source: Unknown file format type
ar: نوع تنسيق ملف مجهول

source: Unsupported integrity check type
ar: نوع فحص سلامة غير مدعوم

source: Only one file can be specified with '--files' or '--files0'.
ar: يمكن تحديد ملف واحد فقط باستخدام '{LRM}--files' أو '{LRM}--files0'.

source: The environment variable %s contains too many arguments
ar: متغير البيئة %s يحتوي على معطيات كثيرة جداً

source: Compression support was disabled at build time
ar: دعم الضغط عُطل وقت البناء

source: Decompression support was disabled at build time
ar: دعم فك الضغط عُطل وقت البناء

source: Compression of lzip files (.lz) is not supported
ar: ضغط ملفات lzip (.lz) غير مدعوم

source: --block-list is ignored unless compressing to the .xz format
ar: يُتجاهل {LRM}--block-list إلا عند الضغط لتنسيق .xz

source: With --format=raw, --suffix=.SUF is required unless writing to stdout
ar: مع {LRM}--format=raw، يلزم {LRM}--suffix=.SUF إلا عند الكتابة للمخرجات القياسية

source: Maximum number of filters is four
ar: أقصى عدد للمرشحات هو أربعة

source: Error in --filters%s=FILTERS option:
ar: خطأ في خيار {LRM}--filters%s=FILTERS:

source: Memory usage limit is too low for the given filter setup.
ar: حد استخدام الذاكرة منخفض جداً لإعداد المرشح المعطى.

source: filter chain %u used by --block-list but not specified with --filters%u=
ar: تسلسل المرشح %u مستخدم بواسطة {LRM}--block-list لكن لم يحدد مع {LRM}--filters%u=

source: Using a preset in raw mode is discouraged.
ar: استخدام مسبق ضبط في الوضع الخام غير محبذ.

source: The exact options of the presets may vary between software versions.
ar: قد تختلف خيارات مسبق الضبط الدقيقة بين إصدارات البرنامج.

source: The .lzma format supports only the LZMA1 filter
ar: تنسيق .lzma يدعم مرشح LZMA1 فقط

source: LZMA1 cannot be used with the .xz format
ar: لا يمكن استخدام LZMA1 مع تنسيق .xz

source: Filter chain %u is incompatible with --flush-timeout
ar: تسلسل المرشح %u غير متوافق مع {LRM}--flush-timeout

source: Switching to single-threaded mode due to --flush-timeout
ar: التحول إلى وضع الخيط الواحد بسبب {LRM}--flush-timeout

source: Unsupported options in filter chain %u
ar: خيارات غير مدعومة في تسلسل المرشح %u

source: Using up to %<PRIu32> threads.
ar: استخدام ما يصل إلى %<PRIu32> خيطاً.

source: Unsupported filter chain or filter options
ar: تسلسل مرشح أو خيارات مرشح غير مدعومة

source: Decompression will need %s MiB of memory.
ar: سيحتاج فك الضغط %s ميجابايت من الذاكرة.

source: Reduced the number of threads from %s to %s to not exceed the memory usage limit of %s MiB
ar: خُفض عدد الخيوط من %s إلى %s لعدم تجاوز حد استخدام الذاكرة البالغ %s ميجابايت

source: Reduced the number of threads from %s to one. The automatic memory usage limit of %s MiB is still being exceeded. %s MiB of memory is required. Continuing anyway.
ar: خُفض عدد الخيوط من %s إلى واحد. حد استخدام الذاكرة الآلي %s ميجابايت لا يزال يُتجاوز. يلزم %s ميجابايت من الذاكرة. الاستمرار على أي حال.

source: Switching to single-threaded mode to not exceed the memory usage limit of %s MiB
ar: التحول إلى وضع الخيط الواحد لعدم تجاوز حد استخدام الذاكرة البالغ %s ميجابايت

source: Adjusted LZMA%c dictionary size from %s MiB to %s MiB to not exceed the memory usage limit of %s MiB
ar: عُدل حجم قاموس LZMA%c من %s ميجابايت إلى %s ميجابايت لعدم تجاوز حد استخدام الذاكرة البالغ %s ميجابايت

source: Adjusted LZMA%c dictionary size for --filters%u from %s MiB to %s MiB to not exceed the memory usage limit of %s MiB
ar: عُدل حجم قاموس LZMA%c لـ {LRM}--filters%u من %s ميجابايت إلى %s ميجابايت لعدم تجاوز حد استخدام الذاكرة البالغ %s ميجابايت

source: Error changing to filter chain %u: %s
ar: خطأ أثناء التغيير إلى تسلسل المرشح %u: %s

source: Error creating a pipe
ar: خطأ أثناء إنشاء أنبوب

source: poll() failed
ar: فشل poll(){LRM}{RLM}

source: File seems to have been moved, not removing
ar: يبدو أن الملف نُقل، لن يُحذف

source: Cannot remove
ar: لا يمكن الحذف

source: Cannot set the file owner
ar: لا يمكن ضبط مالك الملف

source: Cannot set the file group
ar: لا يمكن ضبط مجموعة الملف

source: Cannot set the file permissions
ar: لا يمكن ضبط أذونات الملف

source: Synchronizing the file failed
ar: فشلت مزامنة الملف

source: Synchronizing the directory of the file failed
ar: فشلت مزامنة دليل الملف

source: Error getting the file status flags from standard input
ar: خطأ أثناء جلب أعلام حالة الملف من المدخلات القياسية

source: Is a symbolic link, skipping
ar: وصلة رمزية، سيُتجاوز

source: Is a directory, skipping
ar: دليل، سيُتجاوز

source: Not a regular file, skipping
ar: ليس ملفاً عادياً، سيُتجاوز

source: File has setuid or setgid bit set, skipping
ar: للملف بت setuid أو setgid مضبوط، سيُتجاوز

source: File has sticky bit set, skipping
ar: للملف بت sticky مضبوط، سيُتجاوز

source: Input file has more than one hard link, skipping
ar: ملف المدخلات له أكثر من وصلة صلبة واحدة، سيُتجاوز

source: Empty filename, skipping
ar: اسم ملف فارغ، سيُتجاوز

source: Error restoring the status flags to standard input
ar: خطأ أثناء استعادة أعلام الحالة للمدخلات القياسية

source: Error getting the file status flags from standard output
ar: خطأ أثناء جلب أعلام حالة الملف من المخرجات القياسية

source: Opening the directory failed
ar: فشل فتح الدليل

source: Destination is not a regular file
ar: الوجهة ليست ملفاً عادياً

source: Error restoring the O_APPEND flag to standard output
ar: خطأ أثناء استعادة علم O_APPEND للمخرجات القياسية

source: Closing the file failed
ar: فشل إغلاق الملف

source: Seeking failed when trying to create a sparse file
ar: فشل السعي عند محاولة إنشاء ملف مبعثر

source: Read error
ar: خطأ قراءة

source: Error seeking the file
ar: خطأ سعي في الملف

source: Unexpected end of file
ar: نهاية ملف غير متوقعة

source: Write error
ar: خطأ كتابة

source: Disabled
ar: معطل

source: Amount of physical memory (RAM):
ar: كمية الذاكرة الفيزيائية (RAM):

source: Number of processor threads:
ar: عدد خيوط المعالج:

source: Compression:
ar: الضغط:

source: Decompression:
ar: فك الضغط:

source: Multi-threaded decompression:
ar: فك ضغط متعدد الخيوط:

source: Default for -T0:
ar: المبدئي لـ {LRM}-T0{RLM}:

source: Hardware information:
ar: معلومات العتاد:

source: Memory usage limits:
ar: حدود استخدام الذاكرة:

source: Streams:
ar: مجاري:

source: Blocks:
ar: كتل:

source: Compressed size:
ar: الحجم المضغوط:

source: Uncompressed size:
ar: الحجم غير المضغوط:

source: Ratio:
ar: النسبة:

source: Check:
ar: الفحص:

source: Stream Padding:
ar: حشو المجرى:

source: Memory needed:
ar: الذاكرة المطلوبة:

source: Sizes in headers:
ar: الأحجام في الترويسات:

source: Number of files:
ar: عدد الملفات:

source: Stream
ar: مجرى

source: Block
ar: كتلة

source: Blocks
ar: كتل

source: CompOffset
ar: إزاحة_الضغط

source: UncompOffset
ar: إزاحة_فك_الضغط

source: CompSize
ar: حجم_الضغط

source: UncompSize
ar: حجم_فك_الضغط

source: TotalSize
ar: الحجم_الكلي

source: Ratio
ar: النسبة

source: Check
ar: فحص

source: CheckVal
ar: قيمة_الفحص

source: Padding
ar: حشو

source: Header
ar: ترويسة

source: Flags
ar: أعلام

source: MemUsage
ar: استخدام_الذاكرة

source: Filters
ar: مرشحات

source: None
ar: لا يوجد

source: Unknown-2
ar: مجهول-2

source: Unknown-3
ar: مجهول-3

source: Unknown-5
ar: مجهول-5

source: Unknown-6
ar: مجهول-6

source: Unknown-7
ar: مجهول-7

source: Unknown-8
ar: مجهول-8

source: Unknown-9
ar: مجهول-9

source: Unknown-11
ar: مجهول-11

source: Unknown-12
ar: مجهول-12

source: Unknown-13
ar: مجهول-13

source: Unknown-14
ar: مجهول-14

source: Unknown-15
ar: مجهول-15

source: File is empty
ar: الملف فارغ

source: Too small to be a valid .xz file
ar: صغير جداً ليكون ملف .xz صالحاً

source: Strms Blocks Compressed Uncompressed Ratio Check Filename
ar: {FSI}مجاري{PDI} {FSI}كتل {PDI} {FSI}مضغوط {PDI} {FSI}غير مضغوط {PDI} {FSI}نسبة {PDI} {FSI}فحص {PDI} {FSI}اسم الملف{PDI}

source: Yes
ar: نعم

source: No
ar: لا

source: Minimum XZ Utils version:
ar: أدنى إصدار لـ XZ Utils{RLM}:

source: %s file
ar: لا ملفات

source: Totals:
ar: المجاميع:

source: --list works only on .xz files (--format=xz or --format=auto)
ar: {LRM}--list يعمل فقط على ملفات .xz ({LRM}--format=xz أو {LRM}--format=auto)

source: Try 'lzmainfo' with .lzma files.
ar: جرب 'lzmainfo' مع ملفات .lzma.

source: --list does not support reading from standard input
ar: {LRM}--list لا يدعم القراءة من المدخلات القياسية

source: Error reading filenames
ar: خطأ أثناء قراءة أسماء الملفات

source: Unexpected end of input when reading filenames
ar: نهاية مدخلات غير متوقعة عند قراءة أسماء الملفات

source: Null character found when reading filenames; maybe you meant to use '--files0' instead of '--files'?
ar: عُثر على محرف فارغ (Null) عند قراءة أسماء الملفات؛ ربما قصدت استخدام '{LRM}--files0' بدلاً من '{LRM}--files'؟

source: Compression and decompression with --robot are not supported yet.
ar: الضغط وفك الضغط باستخدام {LRM}--robot غير مدعومين بعد.

source: Cannot read data from standard input when reading filenames from standard input
ar: لا يمكن قراءة البيانات من المدخلات القياسية عند قراءة أسماء الملفات من المدخلات القياسية

source: LTR
ar: RTL

source: Internal error (bug)
ar: خطأ داخلي (علة)

source: Cannot establish signal handlers
ar: لا يمكن إنشاء معالجات الإشارات

source: No integrity check; not verifying file integrity
ar: لا يوجد فحص سلامة؛ لن تُتحقق سلامة الملف

source: Unsupported type of integrity check; not verifying file integrity
ar: نوع فحص سلامة غير مدعوم؛ لن تُتحقق سلامة الملف

source: Memory usage limit reached
ar: وصُل إلى حد استخدام الذاكرة

source: File format not recognized
ar: تنسيق الملف غير معروف

source: Unsupported options
ar: خيارات غير مدعومة

source: Compressed data is corrupt
ar: البيانات المضغوطة تالفة

source: Unexpected end of input
ar: نهاية مدخلات غير متوقعة

source: %s MiB of memory is required. The limiter is disabled.
ar: يلزم %s ميجابايت من الذاكرة. المحدد معطل.

source: %s MiB of memory is required. The limit is %s.
ar: يلزم %s ميجابايت من الذاكرة. الحد هو %s.

source: Filter chain
ar: تسلسل المرشح

source: Try '%s --help' for more information.
ar: جرب '%s {LRM}--help' لمزيد من المعلومات.

source: Error printing the help text (error code %d)
ar: خطأ أثناء طباعة نص المساعدة (رمز الخطأ %d)

source: Usage: %s [OPTION]... [FILE]...
ar: الاستخدام: %s [خيار]... [ملف]...

source: Compress or decompress FILEs in the .xz format.
ar: ضغط أو فك ضغط الملفات بتنسيق .xz.

source: Mandatory arguments to long options are mandatory for short options too.
ar: المعطيات الإلزامية للخيارات الطويلة إلزامية للخيارات القصيرة أيضاً.

source: Operation mode:
ar: وضع العملية:

source: force compression
ar: فرض الضغط

source: force decompression
ar: فرض فك الضغط

source: test compressed file integrity
ar: اختبار سلامة الملف المضغوط

source: list information about .xz files
ar: إدراج معلومات حول ملفات .xz

source: Operation modifiers:
ar: مغيرات العملية:

source: keep (don't delete) input files
ar: الإبقاء على ملفات المدخلات (عدم حذفها)

source: force overwrite of output file and (de)compress links
ar: فرض الكتابة فوق ملف المخرجات وضغط/فك ضغط الوصلات

source: write to standard output and don't delete input files
ar: الكتابة للمخرجات القياسية وعدم حذف ملفات المدخلات

source: don't synchronize the output file to the storage device before removing the input file
ar: عدم مزامنة ملف المخرجات مع جهاز التخزين قبل إزالة ملف المدخلات

source: decompress only the first stream, and silently ignore possible remaining input data
ar: فك ضغط المجرى الأول فقط، وتجاهل بيانات المدخلات المتبقية بصمت

source: do not create sparse files when decompressing
ar: عدم إنشاء ملفات مبعثرة عند فك الضغط

source: use the suffix '.SUF' on compressed files
ar: استخدام اللاحقة '.SUF' على الملفات المضغوطة

source: FILE
ar: ملف

source: read filenames to process from FILE; if FILE is omitted, filenames are read from the standard input; filenames must be terminated with the newline character
ar: قراءة أسماء الملفات لمعالجتها من 'ملف'؛ إذا حُذف 'ملف'، تُقرأ الأسماء من المدخلات القياسية؛ يجب إنهاء الأسماء بمحرف سطر جديد

source: like --files but use the null character as terminator
ar: مثل {LRM}--files ولكن استخدم المحرف الفارغ (Null) كمنهٍ

source: Basic file format and compression options:
ar: خيارات تنسيق الملف والضغط الأساسية:

source: FORMAT
ar: تنسيق

source: file format to encode or decode; possible values are 'auto' (default), 'xz', 'lzma', 'lzip', and 'raw'
ar: تنسيق الملف للترميز أو فك الترميز؛ القيم الممكنة هي 'auto' (مبدئي)، و 'xz'، و 'lzma'، و 'lzip'، و 'raw'

source: NAME
ar: اسم

source: integrity check type: 'none' (use with caution), 'crc32', 'crc64' (default), or 'sha256'
ar: نوع فحص السلامة: 'none' (استخدمه بحذر)، 'crc32'، 'crc64' (مبدئي)، أو 'sha256'

source: don't verify the integrity check when decompressing
ar: عدم التحقق من فحص السلامة عند فك الضغط

source: compression preset; default is 6; take compressor *and* decompressor memory usage into account before using 7-9!
ar: مسبق ضبط الضغط؛ المبدئي هو 6؛ ضع استخدام ذاكرة الضاغط وفك الضغط في الحسبان قبل استخدام 7-9!

source: try to improve compression ratio by using more CPU time; does not affect decompressor memory requirements
ar: محاولة تحسين نسبة الضغط باستخدام مزيد من وقت المعالج؛ لا يؤثر على متطلبات ذاكرة فك الضغط

source: NUM
ar: عدد

source: use at most NUM threads; the default is 0 which uses as many threads as there are processor cores
ar: استخدام عدد الخيوط المعطى على الأكثر؛ المبدئي هو 0 الذي يستخدم خيوطاً بقدر عدد نوى المعالج

source: SIZE
ar: حجم

source: start a new .xz block after every SIZE bytes of input; use this to set the block size for threaded compression
ar: بدء كتلة .xz جديدة بعد كل عدد من بايتات من المدخلات؛ استخدم هذا لضبط حجم الكتلة للضغط متعدد الخيوط

source: BLOCKS
ar: كتل

source: start a new .xz block after the given comma-separated intervals of uncompressed data; optionally, specify a filter chain number (0-9) followed by a ':' before the uncompressed data size
ar: بدء كتلة .xz جديدة بعد الفواصل المعطاة والمفصولة بفاصلة من البيانات غير المضغوطة؛ اختيارياً، حدد رقم تسلسل مرشح (0-9) متبوعاً بـ ':' قبل حجم البيانات غير المضغوطة

source: when compressing, if more than NUM milliseconds has passed since the previous flush and reading more input would block, all pending data is flushed out
ar: عند الضغط، إذا مر أكثر من مقدار ميلي ثانية المعطاة منذ التفريغ السابق وكانت قراءة مزيد من المدخلات ستتسبب في توقف، تُفرغ كل البيانات المعلقة

source: LIMIT
ar: حد

source: set memory usage limit for compression, decompression, threaded decompression, or all of these; LIMIT is in bytes, % of RAM, or 0 for defaults
ar: ضبط حد استخدام الذاكرة للضغط، أو فك الضغط، أو فك الضغط متعدد الخيوط، أو كل هؤلاء؛ 'الحد' بالبايت، أو % من الذاكرة (RAM)، أو 0 للمبدئي

source: if compression settings exceed the memory usage limit, give an error instead of adjusting the settings downwards
ar: إذا تجاوزت إعدادات الضغط حد استخدام الذاكرة، أعطِ خطأً بدلاً من تعديل الإعدادات للأسفل

source: Custom filter chain for compression (an alternative to using presets):
ar: تسلسل مرشح مخصص للضغط (بديل لاستخدام مسبقات الضبط):

source: FILTERS
ar: مرشحات

source: set the filter chain using the liblzma filter string syntax; use --filters-help for more information
ar: ضبط تسلسل المرشح باستخدام بناء جملة سلسلة مرشح liblzma؛ استخدم {LRM}--filters-help لمزيد من المعلومات

source: set additional filter chains using the liblzma filter string syntax to use with --block-list
ar: ضبط تسلسلات مرشحات إضافية باستخدام بناء جملة سلسلة مرشح liblzma للاستخدام مع {LRM}--block-list

source: display more information about the liblzma filter string syntax and exit
ar: عرض مزيد من المعلومات حول بناء جملة سلسلة مرشح liblzma والخروج

source: OPTS
ar: خيارات

source: LZMA1 or LZMA2; OPTS is a comma-separated list of zero or more of the following options (valid values; default):
ar: LZMA1 أو LZMA2؛ الخيارات هي قائمة مفصولة بفاصلة من صفر أو أكثر من الخيارات التالية (قيم صالحة؛ مبدئي):

source: PRE
ar: ضبط

source: reset options to a preset
ar: إعادة ضبط الخيارات لمسبق ضبط

source: dictionary size
ar: حجم القاموس

source: number of literal context bits
ar: عدد بتات سياق الحروف

source: number of literal position bits
ar: عدد بتات موضع الحروف

source: number of position bits
ar: عدد بتات الموضع

source: MODE
ar: وضع

source: compression mode
ar: وضع الضغط

source: nice length of a match
ar: طول المطابقة الجيد

source: match finder
ar: باحث المطابقة

source: maximum search depth; 0=automatic (default)
ar: أقصى عمق بحث؛ 0=آلي (مبدئي)

source: x86 BCJ filter (32-bit and 64-bit)
ar: مرشح x86 BCJ (32-بت و 64-بت)

source: ARM BCJ filter
ar: مرشح ARM BCJ

source: ARM-Thumb BCJ filter
ar: مرشح ARM-Thumb BCJ

source: ARM64 BCJ filter
ar: مرشح ARM64 BCJ

source: PowerPC BCJ filter (big endian only)
ar: مرشح PowerPC BCJ (big endian فقط)

source: IA-64 (Itanium) BCJ filter
ar: مرشح IA-64 (Itanium) BCJ

source: SPARC BCJ filter
ar: مرشح SPARC BCJ

source: RISC-V BCJ filter
ar: مرشح RISC-V BCJ

source: Valid OPTS for all BCJ filters:
ar: خيارات صالحة لكل مرشحات BCJ:

source: start offset for conversions (default=0)
ar: بدء الإزاحة للتحويلات (مبدئي=0)

source: Delta filter; valid OPTS (valid values; default):
ar: مرشح دلتا؛ خيارات صالحة (قيم صالحة؛ مبدئي):

source: distance between bytes being subtracted from each other
ar: المسافة بين البايتات التي تُطرح من بعضها البعض

source: Other options:
ar: خيارات أخرى:

source: suppress warnings; specify twice to suppress errors too
ar: كتم التحذيرات؛ حددها مرتين لكتم الأخطاء أيضاً

source: be verbose; specify twice for even more verbose
ar: كن مسهباً؛ حددها مرتين لمزيد من الإسهاب

source: make warnings not affect the exit status
ar: اجعل التحذيرات لا تؤثر على حالة الخروج

source: use machine-parsable messages (useful for scripts)
ar: استخدم رسائل قابلة للتحليل آلياً (مفيدة للسكربتات)

source: display the total amount of RAM and the currently active memory usage limits, and exit
ar: عرض إجمالي كمية الذاكرة (RAM) وحدود استخدام الذاكرة النشطة حالياً، والخروج

source: display the short help (lists only the basic options)
ar: عرض المساعدة القصيرة (تدرج الخيارات الأساسية فقط)

source: display this long help and exit
ar: عرض هذه المساعدة الطويلة والخروج

source: display this short help and exit
ar: عرض هذه المساعدة القصيرة والخروج

source: display the long help (lists also the advanced options)
ar: عرض المساعدة الطويلة (تدرج أيضاً الخيارات المتقدمة)

source: display the version number and exit
ar: عرض رقم الإصدار والخروج

source: With no FILE, or when FILE is -, read standard input.
ar: عند عدم وجود ملف، أو عندما يكون الملف هو -، تُقرأ المدخلات القياسية.

source: Report bugs to <%s> (in English or Finnish).
ar: أبلغ عن العلل إلى {LRI}<%s>{PDI} (بالانجليزية أو الفنلندية).

source: %s home page: <%s>
ar: الصفحة الرئيسية لـ %s{RLM}: {LRI}<%s>{PDI}

source: THIS IS A DEVELOPMENT VERSION NOT INTENDED FOR PRODUCTION USE.
ar: هذا إصدار تطويري غير مخصص للاستخدام الإنتاجي.

source: Filter chains are set using the --filters=FILTERS or --filters1=FILTERS ... --filters9=FILTERS options. Each filter in the chain can be separated by spaces or '--'. Alternatively a preset %s can be specified instead of a filter chain.
ar: تُضبط تسلسلات المرشحات باستخدام الخيارات {LRM}--filters=FILTERS أو {LRM}--filters1=FILTERS ... {LRM}--filters9=FILTERS. يمكن فصل كل مرشح في التسلسل بمسافات أو '--'. بدلاً من ذلك، يمكن تحديد مسبق ضبط %s بدلاً من تسلسل المرشح.

source: The supported filters and their options are:
ar: المرشحات المدعومة وخياراتها هي:

source: Options must be 'name=value' pairs separated with commas
ar: يجب أن تكون الخيارات أزواج 'name=value' مفصولة بفواصل

source: Invalid option name
ar: اسم خيار غير صالح

source: Invalid option value
ar: قيمة خيار غير صالحة

source: Unsupported LZMA1/LZMA2 preset
ar: مسبق ضبط LZMA1/LZMA2 غير مدعوم

source: The sum of lc and lp must not exceed 4
ar: يجب ألا يتجاوز مجموع lc و lp العدد 4

source: Filename has an unknown suffix, skipping
ar: اسم الملف له لاحقة مجهولة، سيُتجاوز

source: File already has '%s' suffix, skipping
ar: الملف لديه بالفعل اللاحقة '%s'، سيُتجاوز

source: Invalid filename suffix
ar: لاحقة اسم ملف غير صالحة

source: Value is not a non-negative decimal integer
ar: القيمة ليست عدداً صحيحاً عشرياً غير سالب

source: Invalid multiplier suffix
ar: لاحقة مضاعف غير صالحة

source: Valid suffixes are 'KiB' (2^10), 'MiB' (2^20), and 'GiB' (2^30).
ar: اللاحقات الصالحة هي 'KiB' (2^10)، و 'MiB' (2^20)، و 'GiB' (2^30).

source: Value of the option '%s' must be in the range [%<PRIu64>, %<PRIu64>]
ar: قيمة الخيار '%s' يجب أن تكون في النطاق [%<PRIu64>, %<PRIu64>]

source: Compressed data cannot be read from a terminal
ar: لا يمكن قراءة البيانات المضغوطة من طرفية

source: Compressed data cannot be written to a terminal
ar: لا يمكن كتابة البيانات المضغوطة إلى طرفية

source: Usage: %s [--help] [--version] [FILE]...
ar: الاستخدام: %s {RLM}[{LRM}--help] {RLM}[{LRM}--version] [ملف]...

source: Show information stored in the .lzma file header.
ar: إظهار المعلومات المخزنة في ترويسة ملف .lzma.

source: File is too small to be a .lzma file
ar: الملف أصغر من أن يكون ملف .lzma

source: Not a .lzma file
ar: ليس ملف .lzma

source: Writing to standard output failed
ar: فشلت الكتابة للمخرجات القياسية

source: Unknown error
ar: خطأ مجهول

source: Unsupported preset
ar: مسبق ضبط غير مدعوم

source: Unsupported flag in the preset
ar: علم غير مدعوم في مسبق الضبط

source: Unknown option name
ar: اسم خيار مجهول

source: Option value cannot be empty
ar: لا يمكن أن تكون قيمة الخيار فارغة

source: Value out of range
ar: القيمة خارج النطاق

source: This option does not support any multiplier suffixes
ar: هذا الخيار لا يدعم أي لاحقات مضاعفة

source: Invalid multiplier suffix (KiB, MiB, or GiB)
ar: لاحقة مضاعف غير صالحة (KiB، MiB، أو GiB)

source: Unknown filter name
ar: اسم مرشح مجهول

source: This filter cannot be used in the .xz format
ar: لا يمكن استخدام هذا المرشح في تنسيق .xz

source: Memory allocation failed
ar: فشل تخصيص الذاكرة

source: Empty string is not allowed, try '6' if a default value is needed
ar: السلسلة الفارغة غير مسموح بها، جرب '6' إذا لزمت قيمة مبدئية

source: The maximum number of filters is four
ar: أقصى عدد للمرشحات هو أربعة

source: Filter name is missing
ar: اسم المرشح مفقود

source: Invalid filter chain ('lzma2' missing at the end?)
ar: تسلسل مرشح غير صالح (هل 'lzma2' مفقود في النهاية؟)
